dayuer/esp-airprint/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 控制台必须走 UART0（Micro-USB 调试口）：
# USB-OTG 外设被 host 模式占用后，原生 USB-Serial/JTAG 与之共用 GPIO19/20，用不了
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# 诊断用：把日志同时镜像到原生 USB-Serial/JTAG，
# 这样在切进 host 模式（PHY 被 OTG 接管）之前的输出能从 DEV 口看到
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 崩溃取证：coredump 写 flash，事后 idf.py coredump-info 读回溯
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# 大 TCP 窗口：打印数据流吞吐关键
# 每条 TCP 连接在 lwip 里各有一份收发缓冲。iOS 会开 8 条并发轮询连接，
# 按 5760 算一条约 11KB，8 条就是 88KB——堆直接被吃光，所有客户端都发不出作业。
# IPP 请求只有 268 字节、应答 4.7KB，2×MSS 完全够用。
CONFIG_LWIP_TCP_WND_DEFAULT=2880
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_RECVMBOX_SIZE=12

# LCD 中文

# socket 池：默认 10 个，被监听+轮询连接+netlog+mDNS 占满后 accept 拿不到新 socket，
# 客户端表现为「连接超时」。提到上限 16。
CONFIG_LWIP_MAX_SOCKETS=16

# Wi-Fi 缓冲默认按高吞吐场景配，我们是低流量设备（请求 268 字节、应答 4.7KB），
# 省下来的几十 KB 正好给 iOS 的多条并发连接用。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# mDNS 任务默认优先级只有 1，而 IPP 服务器是 5。iOS 开 6 条连接高频轮询时
# 会把 mDNS 饿死——设备找得到打印机（空闲时解析成功），但要发作业新开连接时
# 主机名解析失败，表现为「无法联系打印机」。抬到与服务器同级。
CONFIG_MDNS_TASK_PRIORITY=5
CONFIG_MDNS_TASK_STACK_SIZE=5120
